from __future__ import annotations

from textual.widgets import Static
from textual.app import RenderResult
from rich.text import Text

MONETA_LOGO = """
█████╗  ██████╗  ███╗   ██╗ ███████╗ ████████╗  █████╗
██╔══██╗ ██╔══██╗ ████╗  ██║ ██╔════╝ ╚══██╔══╝ ██╔══██╗
██║  ██║ ██████╔╝ ██╔██╗ ██║ █████╗      ██║    ███████║
██║  ██║ ██╔══██╗ ██║╚██╗██║ ██╔══╝      ██║    ██╔══██║
█████╔╝ ██║  ██║ ██║ ╚████║ ███████╗    ██║    ██║  ██║
╚════╝  ╚═╝  ╚═╝ ╚═╝  ╚═══╝ ╚══════╝    ╚═╝    ╚═╝  ╚═╝
"""

CORAL = "#FF6F61"


class MonetaTitle(Static):
    def render(self) -> RenderResult:
        coral = Text(MONETA_LOGO, style=f"bold {CORAL}")
        return coral
